Repository: liyishibeck-ctrl/Buddhist_Text_Analysis_Platform
Catalog: data/raw/tibetan/84000/data-translation-memory-master/toh9-v3.tmx
Source language: bo
Languages: en

source: དབུ་སྤྱི་གཙུག་དང་ལྡན་པ་སྟེ། དེ་ནི་མངའ་ཆེན་པོ་མངའ་བའི་སྔ་ལྟས་སོ།
en: These are prior indications that they will acquire great dominion. (

source: །ཡུན་རིང་པོར་ཚིག་སྙན་ཅིང་འཇམ་པ་དང་། ཉམས་སུ་བདེ་བར་སྨྲས་པས། ལྗགས་ཤིན་དུ་ཡངས་ཤིང་སྲབ་པ་དང་། ཚངས་པའི་དབྱངས་ཏེ།
en: 24–25) They are endowed with an extremely long and slender tongue and the divine voice of Brahmā because over a long time they have spoken pleasant, gentle, and comforting words.

source: དེ་གཉིས་ནི་ཡན་ལག་ལྔ་དང་ལྡན་པའི་གསུང་མངའ་བའི་སྔ་ལྟས་སོ། །གསུང་ཡན་ལག་ལྔ་དང་ལྡན་པ་ཞེས་བྱ་བ་ནི་ཡོངས་སུ་ཤེས་ཤིང་། རྣམ་པར་ཤེས་པར་འགྱུར་བ་དང་། མཉན་ན་དགའ་ཞིང་མི་མཐུན་པ་མེད་པ་དང་། ཟབ་ཅིང་དབྱངས་རྗེས་སུ་འབྱུང་བ་དང་།
en: These two are prior indications that they will possess speech endowed with five qualities, which comprise [speech that is] (i) comprehensible and sensible, (ii) delightful to hear and lacking in discord, (iii) deep and melodious, (iv) clear and pleasant to the ears, and (v) undisturbed and lucid. (

source: གཏང་མི་བྲ་ཞིང་རྣར་སྙན་པ་དང་། མ་འཁྲུགས་ཤིང་གསལ་བའོ། །ཡུན་རིང་པོ་ནས་ཚིག་ཀྱལ་པ་སྤངས་ཤིང་། དུས་སུ་སྨྲ་བས་སེང་གེའི་འགྲམ་པ་ལྟ་བུ་སྟེ།
en: 26) They are endowed with lion-like jaws because for a long time they have abandoned nonsensical chatter and speak in a timely manner.

source: དེ་ནི་ཚིག་ཀུན་གྱིས་མཉན་པའི་སྔ་ལྟས་སོ། །རིམ་གྲོར་བྱ་བ་དང་།
en: This is a prior indication that their words will be heard by all. (

source: བརྙས་པ་མེད་པ་གཉིས་ཀྱིས་འཚོ་བ་ཡོངས་སུ་དག་པས། ཚེམས་ཤིན་དུ་དཀར་བ་དང་མཉམ་པ་སྟེ།
en: 27–28) They are endowed with extremely white teeth and extremely even teeth because they have engaged in pure livelihood through both acts of service and words that are without contempt.

source: དེ་ནི་འཁོར་སྔ་ནས་བསགས་པའི་སྔ་ལྟས་སོ།
en: These are prior indications that they will have an entourage that has previously been assembled. (

source: །ཡུན་རིང་པོ་ནས་བདེན་ཞིང་ཕྲ་མ་མེད་པའི་ཚིག་སྨྲ་བས། ཚེམས་ཐགས་བཟང་བ་དང་། ཚེམས་མཉམ་ཞིང་བཞི་བཅུ་ཚང་བ་སྟེ།
en: 29–30) They are endowed with close-fitting teeth and a full set of forty even teeth because over a long time they have spoken words that are true and without slander.

source: དེ་ནི་འཁོར་དབྱེར་མི་ཕྱེད་པའི་སྔ་ལྟས་སོ།
en: These are prior indications that they will not be separated from their entourage. (

source: །པང་གིས་འཁྱུད་པ་བཞིན་དུ་ཉེས་པར་བསམ་པ་མེད་ལ་མ་ཆགས་མི་སྡང་བ་དང་། རྨོངས་པ་མེད་པའི་མིག་གིས་ལྟ་ལྟ་བས་སྤྱན་དཀར་ནག་འབྱེས་པ་དང་། བའི་རྫི་མ་ལྟ་བུ་སྟེ།
en: 31–32) They have [deep blue eyes] in which the light and dark parts are distinct, and they have eyelashes like those of a cow, because they gaze [upon beings] with eyes devoid of attachment, hatred, and delusion, without considering their defects, as if embracing them on their lap [like a mother].

source: དེ་ནི་ཀུན་ནས་མཛེས་པའི་སྔ་ལྟས་སོ།
en: These are prior indications that they will be beautiful in all respects.

source: །རབ་འབྱོར་དེ་དག་ནི་དེ་བཞིན་གཤེགས་པའི་མི་ཆེན་པོའི་མཚན་སུམ་ཅུ་རྩ་གཉིས་སོ།
en: Subhūti, these are the thirty-two major marks of a great person that the tathāgatas possess. “

source: །དེ་ལ་དེ་བཞིན་གཤེགས་པའི་དཔེ་བྱད་བཟང་པོ་བརྒྱད་བཅུ་གང་ཞེ་ན། འདི་ལྟ་སྟེ། སངས་རྒྱས་བཅོམ་ལྡན་འདས་རྣམས་ནི་མངོན་པར་འདུ་བྱ་བ་ཐམས་ཅད་ལས་དབེན་པ་སྟེ། སེན་མོ་ཟངས་ཀྱི་མདོག་ལྟར་འདུག་པ་ཡིན།
en: If you ask what constitute the tathāgatas’ eighty minor marks, they are as follows: (1) The lord buddhas are endowed with copper-colored nails—that is to say, they are detached from any conditioning. (

source: སངས་རྒྱས་བཅོམ་ལྡན་འདས་རྣམས་ནི་གཉེན་བཤེས་བྱམས་པ་དང་འདྲ་བར་སེམས་ཅན་ལ་ཕན་པ་དང་བདེ་བའི་ཐུགས་མངའ་བ་སྟེ། སེན་མོའི་མདོག་སྣུམ་པ་ཡིན།
en: 2) The lord buddhas are endowed with glossy nails—indicating that they have a mind intent on bringing spiritual and temporal well-being to [all] beings, resembling the love of friendship. (

source: སངས་རྒྱས་བཅོམ་ལྡན་འདས་རྣམས་ནི་རིགས་དང་རྒྱུད་མཐོན་པོར་བྱུང་བ་སྟེ། སེན་མོ་མཐོ་བ་ཡིན།
en: 3) The lord buddhas are endowed with elevated nails—indicating that they emerge within high families and clans. (

source: སངས་རྒྱས་བཅོམ་ལྡན་འདས་རྣམས་ནི་ཚུལ་ཁ་ན་མ་ཐོ་བ་མི་མངའ་བ་སྟེ།
en: 4) The lord buddhas are endowed with round fingers and toes—indicating that their conduct is without the inadmissible transgressions. (

source: སོར་མོ་ཟླུམ་པ་ཡིན། སངས་རྒྱས་བཅོམ་ལྡན་འདས་རྣམས་ནི་དགེ་བའི་རྩ་བ་ཤིན་དུ་ཚོགས་པ་སྟེ།
en: 5) The lord buddhas are endowed with compact fingers and toes—indicating that they have absolutely amassed the roots of virtuous action. (

source: སོར་མོ་རྒྱས་པ་ཡིན། སངས་རྒྱས་བཅོམ་ལྡན་འདས་རྣམས་ནི་དགེ་བའི་རྩ་བ་རིམ་གྱིས་གྲུབ་པ་སྟེ། སོར་མོ་རིམ་གྱིས་གཞོལ་བ་ཡིན།
en: 6) The lord buddhas are endowed with tapering fingers and toes—indicating that they have gradually accomplished the roots of virtuous action. (

source: སངས་རྒྱས་བཅོམ་ལྡན་འདས་རྣམས་ནི་ཐུགས་དང་གསུང་དང་། སྐུའི་ཕྲིན་ལས་དང་། འཚོ་བ་ཤིན་ཏུ་དབེན་པ་སྟེ། རྩ་མི་མངོན་པ་ཡིན།
en: 7) The lord buddhas are endowed with inconspicuous blood vessels and nerves—indicating that their actions of body, speech, and mind and their livelihoods are very detached. (

source: སངས་རྒྱས་བཅོམ་ལྡན་འདས་རྣམས་ནི། ཉོན་མོངས་པའི་མདུད་པ་འགྲོལ་བ་སྟེ། རྩ་ལ་མདུད་པ་མེད་པ་ཡིན།
en: 8) The lord buddhas are endowed with blood vessels and nerves that are unknotted—indicating that they are liberated from the knots of afflicted mental states. (

source: སངས་རྒྱས་བཅོམ་ལྡན་འདས་རྣམས་ནི་ཤིན་ཏུ་དབེན་པའི་ཆོས་མངའ་བ་སྟེ། ལོང་བུ་མི་མངོན་པ་ཡིན།
en: 9) The lord buddhas are endowed with inconspicuous ankles—indicating that they possess the qualities of being utterly detached. (

source: སངས་རྒྱས་བཅོམ་ལྡན་འདས་རྣམས་ནི་མི་མཉམ་པ་ཐམས་ཅད་ལས་སྒྲོལ་བ་སྟེ།
en: 10) The lord buddhas are endowed with legs that are well proportioned—indicating that they are liberated from all imbalances. {

source: ཞབས་མི་མཉམ་པ་མེད་པ་ཡིན།
en: Ki.

source: སངས་རྒྱས་བཅོམ་ལྡན་འདས་རྣམས་ནི་མིའི་སེང་གེ་སྟེ།
en: VIII: 65} (11) The lord buddhas are endowed with the gait of a lion—indicating that they are lions among men. (

source: སེང་གེའི་འགྲོས་སུ་བཞུད་པ་ཡིན། སངས་རྒྱས་བཅོམ་ལྡན་འདས་རྣམས་ནི་མིའི་གླང་པོ་སྟེ།
en: 12) The lord buddhas are endowed with the gait of an elephant—indicating that they are elephants among men. (

source: གླང་པོའི་འགྲོས་སུ་བཞུད་པ་ཡིན། སངས་རྒྱས་བཅོམ་ལྡན་འདས་རྣམས་ནི་ངང་པའི་རྒྱལ་པོ་ལྟར་ནམ་མཁའ་ལ་བཞུད་པ་སྟེ། ངང་པའི་སྟབས་སུ་བཞུད་པ་ཡིན།
en: 13) The lord buddhas are endowed with the gait of a swan—indicating that they move through space like the king of swans. (

source: སངས་རྒྱས་བཅོམ་ལྡན་འདས་རྣམས་ནི་མིའི་ཁྱུ་མཆོག་སྟེ། ཁྱུ་མཆོག་གི་སྟབས་སུ་བཞུད་པ་ཡིན།
en: 14) The lord buddhas are endowed with the gait of a leading bull—indicating that they are leaders among men. (

source: སངས་རྒྱས་བཅོམ་ལྡན་འདས་རྣམས་ནི་འཐུན་པའི་ལམ་མངའ་བ་སྟེ། གཡས་ཕྱོགས་སུ་བཞུད་པ་ཡིན།
en: 15) The lord buddhas are endowed with a gait turning to the right—indicating that they have acquired the path of harmony. (

source: སངས་རྒྱས་བཅོམ་ལྡན་འདས་རྣམས་ནི་བལྟ་ན་མཛེས་པ་སྟེ། མཛེས་པར་བཞུད་པ་ཡིན།
en: 16) The lord buddhas are endowed with an elegant gait—indicating that they are elegant to behold. (

source: སངས་རྒྱས་བཅོམ་ལྡན་འདས་རྣམས་ནི་རྟག་ཏུ་ཐུགས་ཡོན་པོ་མི་མངའ་བ་སྟེ།
en: 17) The lord buddhas are endowed with a steady gait—indicating that their mind is never erratic. (

source: མི་ཡོ་བར་བཞུད་པ་ཡིན། སངས་རྒྱས་བཅོམ་ལྡན་འདས་རྣམས་ནི་ཚུལ་རྣམ་པར་དག་པའི་ཡོན་ཏན་སྟོན་པ་སྟེ། སྐུ་ཤིན་ཏུ་ལེགས་པ་ཡིན།
en: 18) The lord buddhas are endowed with a body that is most excellent—indicating that they display the attributes of pure ethical discipline. (

source: སངས་རྒྱས་བཅོམ་ལྡན་འདས་རྣམས་ནི་སྡིག་པའི་ཆོས་རྣམས་ཤིན་དུ་སྦྱངས་པ་སྟེ། སྐུ་ཤིན་དུ་སྦྱངས་པ་ཡིན།
en: 19) The lord buddhas are endowed with a body that is utterly refined—indicating that they have utterly refined negative attributes. (

source: སངས་རྒྱས་བཅོམ་ལྡན་འདས་རྣམས་ནི་ཆོས་རིམ་གྱིས་སྟོན་པ་སྟེ། སྐུ་རིམ་གྱིས་གཞོལ་བ་ཡིན།
en: 20) The lord buddhas are endowed with a body that is tapering—indicating that they gradually reveal their attributes. (

source: སངས་རྒྱས་བཅོམ་ལྡན་འདས་རྣམས་ནི་སྐུ་དང་། གསུང་དང་། ཐུགས་གཙང་མ་དང་ལྡན་པ་སྟེ། སྐུ་ཤིན་དུ་གཙང་བ་ཡིན།
en: 21) The lord buddhas are endowed with a body that is utterly clean—indicating that they have cleanliness of body, speech, and mind. (

source: སངས་རྒྱས་བཅོམ་ལྡན་འདས་རྣམས་ནི་རང་བཞིན་གྱིས་ཐུགས་འཇམ་པ་དང་ལྡན་པ་སྟེ། སྐུ་ཤིན་དུ་འཇམ་པ་ཡིན།
en: 22) The lord buddhas are endowed with a body that is utterly soft—indicating that they have a mind that is naturally gentle. (

source: སངས་རྒྱས་བཅོམ་ལྡན་འདས་རྣམས་ནི་རང་བཞིན་གྱིས་རྣམ་པར་དག་པའི་ཐུགས་མངའ་བ་སྟེ། སྐུ་ཤིན་དུ་རྣམ་པར་དག་པ་ཡིན།
en: 23) The lord buddhas are endowed with a body that is utterly pure—indicating that they have a mind that is naturally pure. (

source: སངས་རྒྱས་བཅོམ་ལྡན་འདས་རྣམས་ནི་ཆོས་དང་འདུལ་བ་ཤིན་དུ་རྫོགས་པ་སྟེ།
en: 24) The lord buddhas are endowed with utterly perfect minor marks—indicating that their doctrine and discipline are utterly perfect. (

source: དཔེ་བྱད་ཤིན་དུ་རྫོགས་པ་ཡིན། སངས་རྒྱས་བཅོམ་ལྡན་འདས་རྣམས་ནི་ཡོན་ཏན་ཡངས་ཤིང་བཟང་བ་སྟོན་པ་སྟེ། སྐུ་ཆེ་ཞིང་མཛེས་པ་ཡིན།
en: 25) The lord buddhas are endowed with a large and beautiful body—indicating that they reveal enlightened attributes that are expansive and noble. (

source: སངས་རྒྱས་བཅོམ་ལྡན་འདས་རྣམས་ནི་སེམས་ཅན་ཐམས་ཅད་ལ་མཉམ་པའི་ཐུགས་མངའ་བ་སྟེ། སྐུ་ལེགས་པར་མཉམ་པ་ཡིན།
en: 26) The lord buddhas are endowed with a well-proportioned body—indicating that they have a mind that regards all beings as the same. (

source: སངས་རྒྱས་བཅོམ་ལྡན་འདས་རྣམས་ནི་མཆོག་ཏུ་འཇམ་པའི་ཆོས་སྟོན་པ་སྟེ། སྐུ་ཤིན་དུ་གཞོན་པ་ཡིན།
en: 27) The lord buddhas are endowed with an utterly youthful body—indicating that they reveal the doctrine that is supremely gentle. (

source: སངས་རྒྱས་བཅོམ་ལྡན་འདས་རྣམས་ནི་རྟག་ཏུ་ཞུམ་པ་མེད་པའི་ཐུགས་མངའ་བ་སྟེ། སྐུ་ཞུམ་པ་མེད་པ་ཡིན།
en: 28) The lord buddhas are endowed with a body that is not bent over—indicating that they have a mind that is never discouraged. (

source: སངས་རྒྱས་བཅོམ་ལྡན་འདས་རྣམས་ནི་མི་དགེ་བའི་རྩ་བ་ཐམས་ཅད་བྱང་བ་སྟེ། སྐུ་ཤིན་དུ་རྒྱས་པ་ཡིན།
en: 29) The lord buddhas are endowed with a body that is extremely compact—indicating that they have purified all the roots of nonvirtuous action. (

source: སངས་རྒྱས་བཅོམ་ལྡན་འདས་རྣམས་ནི་ཡང་འབྱུང་བ་ཤིན་ཏུ་བཅོམ་ཞིང་ཟད་པ་སྟེ། སྐུ་ཤིན་དུ་མཁྲེགས་པ་ཡིན།
en: 30) The lord buddhas are endowed with a body that is extremely firm—indicating that they have utterly vanquished and ended the recurrence [of rebirth]. (

source: སངས་རྒྱས་བཅོམ་ལྡན་འདས་རྣམས་ནི་རྟེན་ཅིང་འབྲེལ་པར་འབྱུང་བའི་ཡན་ལག་དང་ཉིང་ལག་ལེགས་པར་སྟོན་པ་སྟེ། ཡན་ལག་དང་ཉིང་ལག་སྤ་བར་མཛེས་པ་ཡིན།
en: 31) The lord buddhas are endowed with elegant and beautiful limbs and appendages—indicating that they excellently reveal the links and subsidiary links of dependent origination. (

source: སངས་རྒྱས་བཅོམ་ལྡན་འདས་རྣམས་ནི་གཟིགས་པ་ཤིན་དུ་དག་པ་སྟེ། སྣང་བ་རབ་རིབ་མེད་ཅིང་རྣམ་པར་དག་པ་ཡིན།
en: 32) The lord buddhas are endowed with undimmed and pure sense perception—indicating that their vision is utterly pure. (

source: སངས་རྒྱས་བཅོམ་ལྡན་འདས་རྣམས་ནི་ཚུལ་དང་ལྡན་པའི་སློབ་མ་མངའ་བ་སྟེ། ཕྱལ་ཟླུམ་པ་ཡིན།
en: 33) The lord buddhas are endowed with a round abdomen—indicating that they have disciples who maintain ethical discipline. (

source: སངས་རྒྱས་བཅོམ་ལྡན་འདས་རྣམས་ནི་འཁོར་བའི་ཉེས་པ་ཐམས་ཅད་ཤིན་དུ་སྦྱངས་པ་སྟེ།
en: 34) The lord buddhas are endowed with an extremely well-shaped abdomen—indicating that they have utterly refined all the defects of cyclic existence. (

source: ཕྱལ་ཤིན་དུ་འཕྱང་བ་དང་ལྡན་པ་ཡིན། སངས་རྒྱས་བཅོམ་ལྡན་འདས་རྣམས་ནི་ང་རྒྱལ་གྱི་དེའུ་བཅོམ་པ་སྟེ། ཕྱལ་མ་ཞོམ་པ་ཡིན།
en: 35) The lord buddhas are endowed with an abdomen that is not wrinkled—indicating that they have conquered the mound of pride. (

source: སངས་རྒྱས་བཅོམ་ལྡན་འདས་རྣམས་ནི་ཆོས་ཟད་པ་རྣམ་པར་བཟློག་པ་སྟེ།
en: 36) The lord buddhas are endowed with an evenly shaped abdomen—indicating that they have averted the cessation of phenomena. (

source: ཕྱལ་ཕྱམ་མེར་འདུག་པ་ཡིན། སངས་རྒྱས་བཅོམ་ལྡན་འདས་རྣམས་ནི་ཆོས་ཟབ་མོ་ཤིན་དུ་ཐུགས་སུ་ཆུད་པ་སྟེ། ལྟེ་བ་ཟབ་པ་ཡིན།
en: 37) The lord buddhas are endowed with a navel that is deep—indicating that they have utterly comprehended the profound Dharma. (

source: སངས་རྒྱས་བཅོམ་ལྡན་འདས་རྣམས་ནི་འཐུན་པར་འཛིན་པའི་སློབ་མ་མངའ་བ་སྟེ། ལྟེ་བ་གཡས་ཕྱོགས་སུ་འཁྱིལ་པ་ཡིན།
en: 38) The lord buddhas are endowed with a navel that curls to the right—indicating that they have disciples who maintain harmony. (

source: སངས་རྒྱས་བཅོམ་ལྡན་འདས་རྣམས་ནི་སློབ་མ་ཀུན་ནས་མཛེས་པའི་དགེ་འདུན་མངའ་བ་སྟེ། ཀུན་ནས་མཛེས་པ་ཡིན།
en: 39) The lord buddhas are endowed with [a body] that is beautiful in all respects—indicating that their disciples form a saṅgha that is beautiful in all respects. (

source: སངས་རྒྱས་བཅོམ་ལྡན་འདས་རྣམས་ནི་ཐུགས་ཤིན་དུ་གཙང་མ་དང་ལྡན་པ་སྟེ།
en: 40) The lord buddhas are utterly chaste in their habitual conduct—indicating that they have a mind that is utterly chaste. (

source: ཀུན་སྤྱོད་པ་ཤིན་དུ་གཙང་བ་ཡིན། །སངས་རྒྱས་བཅོམ་ལྡན་འདས་རྣམས་ནི་ཆོས་ནག་པོ་བསྟན་པ་དང་བྲལ་བའི་ཆོས་དང་འདུལ་བ་མངའ་བ་སྟེ། སྐུ་ལ་སྨེ་བ་མེད་པ་ཡིན།
en: 41) The lord buddhas are endowed with a body that is unblemished by moles—indicating that they possess the Dharma and Vinaya that are divorced from the teaching of negative attributes. (

source: སངས་རྒྱས་བཅོམ་ལྡན་འདས་རྣམས་ནི་ཤིང་བལ་ལྟར་རབ་ཏུ་ཡང་བ་རབ་ཏུ་འཐོབ་པའི་ཆོས་སྟོན་པ་སྟེ། ཕྱག་ཤིང་བལ་ལྟར་ཤིན་དུ་འཇམ་པ་ཡིན།
en: 42) The lord buddhas are endowed with hands that are extremely soft like tree cotton—indicating that they teach the Dharma whereby lightness [of body], like tree cotton, is attained. (

source: སངས་རྒྱས་བཅོམ་ལྡན་འདས་རྣམས་ནི་རང་གི་སྐྱེ་བོ་དང་སྐྱེ་བོ་ཕལ་ལ་བྱམས་པས་དགེ་སྦྱོང་ཆེན་པོ་བརྙེས་པ་སྟེ། ཕྱག་གི་རི་མོ་སྣུམ་པ་ཡིན།
en: 43) The lord buddhas have hands with brilliant lines—indicating that they have acquired the status of a great ascetic owing to their loving kindness for kinsmen, and ordinary people. (

source: སངས་རྒྱས་བཅོམ་ལྡན་འདས་རྣམས་ནི་ཤིན་དུ་ཟབ་ཅིང་བརྟན་པར་བཞུགས་པ་སྟེ། ཕྱག་གི་རི་མོ་ཟབ་པ་ཡིན།
en: 44) The lord buddhas have hands with deep lines—indicating that they are extremely profound and steadfast. (

source: སངས་རྒྱས་བཅོམ་ལྡན་འདས་རྣམས་ནི་བཟོད་པའི་ཆོས་ཡངས་པ་སྟོན་པ་སྟེ། ཕྱག་གི་རི་མོ་རིང་བ་ཡིན།
en: 45) The lord buddhas have hands with long lines—indicating that they teach the expansive doctrine of tolerance. (

source: སངས་རྒྱས་བཅོམ་ལྡན་འདས་རྣམས་ནི་བསླབ་པའི་གནས་ཧ་ཅང་ཡང་མི་རིང་བར་འཆའ་བ་སྟེ། ཞལ་ཧ་ཅང་ཡང་མི་རིང་བ་ཡིན།
en: 46) The lord buddhas are endowed with a face that is not too long—indicating that they establish and make known the topics of training in not too long a time. (

source: སངས་རྒྱས་བཅོམ་ལྡན་འདས་རྣམས་ནི་གཟུགས་བརྙན་འཇིག་རྟེན་དུ་བཀྱེ་བ་སྟེ། ཞལ་གཟུགས་ཀྱི་གཟུགས་བརྙན་སྣང་བ་ཡིན།
en: 47) The lord buddhas are endowed with a face that appears like a form being reflected—indicating that they have reflections that spread forth in the world. (

source: སངས་རྒྱས་བཅོམ་ལྡན་འདས་རྣམས་ནི་འཇམ་པ་སྔོན་དུ་བཏང་ཞིང་འདུལ་བ་སྟེ།
en: 48) The lord buddhas are endowed with a tongue that is extremely soft—indicating that they have first gently mollified and then disciplined [their disciples]. (

source: ལྗགས་ཤིན་དུ་འཇམ་པ་ཡིན། སངས་རྒྱས་བཅོམ་ལྡན་འདས་རྣམས་ནི་ཡོན་ཏན་ཕྲ་བའི་ཚོགས་དང་ལྡན་པ་སྟེ།
en: 49) The lord buddhas are endowed with a tongue that is extremely slender—indicating that they possess a mass of subtle enlightened attributes. (

source: ལྗགས་ཤིན་དུ་སྲབ་པ་ཡིན། སངས་རྒྱས་བཅོམ་ལྡན་འདས་རྣམས་ནི་བྱིས་པའི་སྐྱེ་བོ་འདོད་ཆགས་པ་རྣམས་ཀྱི་ཆོས་དང་འདུལ་བ་གཏིང་དཔག་པར་དཀའ་བ་སྟེ། ལྗགས་ཤིན་དུ་དམར་བ་ཡིན།
en: 50) The lord buddhas are endowed with a tongue that is extremely red—indicating that the profundity of their Dharma and Vinaya is hard for ordinary attached persons to estimate. (

source: སངས་རྒྱས་བཅོམ་ལྡན་འདས་རྣམས་ནི་གླང་པོའི་སྒྲ་དང་། འབྲུག་གི་སྒྲ་ལྟ་བུས་བསྙེངས་པ་མི་མངའ་བ་སྟེ། གླང་པོའི་ང་རོ་དང་། འབྲུག་གི་དབྱངས་དང་ལྡན་པ་ཡིན།
en: 51) The lord buddhas are endowed with a voice like the trumpeting of an elephant or the roar of a dragon—indicating that they are without trepidation, just like the trumpeting of an elephant or the roar of a dragon. (

source: སངས་རྒྱས་བཅོམ་ལྡན་འདས་རྣམས་ནི་སྙན་ཅིང་འཇམ་པ་དང་། ཉམས་སུ་བདེ་བར་སྨྲ་བའི་སློབ་མ་མངའ་བ་སྟེ། སྙན་ཅིང་འཇམ་པ་དང་ཉམས་སུ་བདེ་བའི་གསུང་དང་ལྡན་པ་ཡིན།
en: 52) The lord buddhas are endowed with speech that is pleasant, gentle, and comforting—indicating that they have disciples whose speech is pleasant, gentle, and comforting. (

source: སངས་རྒྱས་བཅོམ་ལྡན་འདས་རྣམས་ནི་སྲིད་པ་ཀུན་དུ་སྦྱོར་བ་ལས་འདས་པ་སྟེ།
en: 53) The lord buddhas are endowed with teeth that are extremely round—indicating that they have transcended the fetters of the rebirth process. (

source: ཚེམས་མཆེ་བ་ཤིན་དུ་ཟླུམ་པ་ཡིན། སངས་རྒྱས་བཅོམ་ལྡན་འདས་རྣམས་ནི་སྐྱེ་བོ་རྣོ་བ་རྣམས་འདུལ་བ་སྟེ།
en: 54) The lord buddhas are endowed with teeth that are sharp—indicating that they discipline living creatures who are sharp. (

source: ཚེམས་མཆེ་བ་རྣོ་བ་དང་ལྡན་པ་ཡིན། སངས་རྒྱས་བཅོམ་ལྡན་འདས་རྣམས་ནི་ཆོས་དང་འདུལ་བ་ཤིན་དུ་དཀར་བ་སྟེ།
en: 55) The lord buddhas are endowed with teeth that are extremely white—indicating that their Dharma and Vinaya are extremely pure. (

source: ཚེམས་མཆེ་བ་ཤིན་དུ་དཀར་བ་ཡིན། སངས་རྒྱས་བཅོམ་ལྡན་འདས་རྣམས་ནི་སའི་ཕྱོགས་མཉམ་པ་ལ་བཞུགས་པ་སྟེ། མཆེ་བ་མཉམ་པ་དང་ལྡན་པ་ཡིན།
en: 56) The lord buddhas are endowed with teeth that are even—indicating that they are evenly established in the [bodhisattva] levels. (

source: སངས་རྒྱས་བཅོམ་ལྡན་འདས་རྣམས་ནི་རིམ་གྱིས་མངོན་པར་རྟོགས་པའི་ཆོས་སྟོན་པ་སྟེ། ཚེམས་མཆེ་བ་རིམ་གྱིས་གཞོལ་བ་ཡིན།
en: 57) The lord buddhas are endowed with teeth that are tapering—indicating that they teach the Dharma in which clear realization gradually emerges. (

source: སངས་རྒྱས་བཅོམ་ལྡན་འདས་རྣམས་ནི་ཤེས་རབ་ཀྱི་རི་བོ་མཐོན་པོ་ལ་བཞུགས་པ་སྟེ།
en: 58) The lord buddhas are endowed with a nose that is prominent—indicating that they are seated on the prominent mountain of wisdom. (

source: ལས་ལེགས་པར་མཐོ་བ་དང་ལྡན་པ་ཡིན། སངས་རྒྱས་བཅོམ་ལྡན་འདས་རྣམས་ནི་འདུལ་བའི་སྐྱེ་བོ་གཙང་མ་མངའ་བ་སྟེ།
en: 59) The lord buddhas are endowed with a nose that is extremely clean—indicating that they have as disciples persons who are clean. (

source: ཤངས་ཤིན་དུ་གཙང་བ་ཡིན། སངས་རྒྱས་བཅོམ་ལྡན་འདས་རྣམས་ནི་སངས་རྒྱས་ཀྱི་ཆོས་ཕུལ་དུ་ཡངས་པ་མངའ་བ་སྟེ། སྤྱན་རིང་བ་དང་ལྡན་པ་ཡིན།
en: 60) The lord buddhas are endowed with eyes that are long—indicating that they have the attributes of the buddhas that are perfectly vast. (

source: སངས་རྒྱས་བཅོམ་ལྡན་འདས་རྣམས་ནི་གཟིགས་པ་ཤིན་དུ་རྣམ་པར་དག་པ་སྟེ། སྤྱན་རྣམ་པར་དག་པ་ཡིན།
en: 61) The lord buddhas are endowed with eyes that are pure—indicating that their vision is extremely pure. (

source: སངས་རྒྱས་བཅོམ་ལྡན་འདས་རྣམས་ནི་སེམས་ཅན་གྱི་ཚོགས་ཤིན་དུ་བསགས་པ་སྟེ།
en: 62) The lord buddhas are endowed with eyelashes that are dense—indicating that they have amassed a large congregation of beings. {

source: རྫི་མ་སྟུག་པ་ཡིན།
en: Ki.

source: སངས་རྒྱས་བཅོམ་ལྡན་འདས་རྣམས་ནི། ལྷ་དང་ལྷ་མ་ཡིན་དང་སྐྱེས་བུ་དང་། ན་ཆུང་མཆོག་གི་མིག་དཀར་ནག་འབྱེས་ཤིང་པད་མོའི་འདབ་མ་ལྟར་འདུག་པ་རྣམས་ཀྱིས་མངོན་པར་དགའ་བར་བྱ་བ་སྟེ། སྤྱན་དཀར་ནག་འབྱེས་ཤིང་པད་མོའི་འདབ་མ་ལྟར་འདུག་པ་ཡིན།
en: VIII: 67} (63) The lord buddhas are endowed with eyes like lotus petals, in which the light and dark parts are distinct—indicating that they delight gods, asuras, human beings, and the foremost of youth with their eyes like lotus petals, in which the white sclera and dark iris are distinct. (

source: སངས་རྒྱས་བཅོམ་ལྡན་འདས་རྣམས་ནི་རྟག་ཏུ་ཡངས་པ་གཟིགས་པ་སྟེ། སྨིན་མ་རིང་བ་དང་ལྡན་པ་ཡིན།
en: 64) The lord buddhas are endowed with long eyebrows—indicating that they always have an expansive vision. (

source: སངས་རྒྱས་བཅོམ་ལྡན་འདས་རྣམས་ནི་འཇམ་པར་འདུལ་བ་ལ་མཁས་པ་སྟེ། སྨིན་མ་འཇམ་པ་དང་ལྡན་པ་ཡིན།
en: 65) The lord buddhas are endowed with soft eyebrows—indicating that they are expert in gentle discipline. (

source: སངས་རྒྱས་བཅོམ་ལྡན་འདས་རྣམས་ནི་སྐྱོན་ཐམས་ཅད་མཁྱེན་པ་སྟེ། སྨིན་མའི་སྤུ་མཉམ་པ་དང་ལྡན་པ་ཡིན།
en: 66) The lord buddhas have eyebrows with hairs of even length—indicating that they understand all faults. (

source: སངས་རྒྱས་བཅོམ་ལྡན་འདས་རྣམས་ནི་དགེ་བའི་རྩ་བའི་སྣུམ་གྱིས། སེམས་ཅན་སྣུམ་པར་གྱུར་པའི་སྐྱེ་བོ་འདུལ་བ་སྟེ། སྨིན་མ་སྣུམ་པ་དང་ལྡན་པ་ཡིན།
en: 67) The lord buddhas have shiny eyebrows—indicating that they discipline persons to be mollified with the moist oil of the roots of virtuous action. (

source: སངས་རྒྱས་བཅོམ་ལྡན་འདས་རྣམས་ནི་ཆོས་མཆོག་ཏུ་ཡངས་ཤིང་དོན་དང་ལྡན་པ་མངའ་བ་སྟེ། སྙན་ལེགས་ཤིང་སྙན་ཤལ་རིང་བ་ཡིན།
en: 68) The lord buddhas are endowed with excellent ears and long earlobes—indicating that they have extensive understanding of the supreme phenomenon. (

source: སངས་རྒྱས་བཅོམ་ལྡན་འདས་རྣམས་ནི་ཉོན་མོངས་པའི་རྒྱུད་ལས་རྣམ་པར་རྒྱལ་བ་སྟེ། སྙན་མཉམ་པ་ཡིན།
en: 69) The lord buddhas are endowed with ears of equal size—indicating that they have triumphed over the continuum of afflicted mental states. (

source: སངས་རྒྱས་བཅོམ་ལྡན་འདས་རྣམས་ནི་སེམས་ཅན་བསམ་པ་མ་ཉམས་པ་འདུལ་བ་སྟེ། སྙན་གྱི་དབང་པོ་མ་ཉམས་པ་དང་ལྡན་པ་ཡིན།
en: 70) The lord buddhas are endowed with sense organs of hearing that are undiminished—indicating that they discipline beings of undiminished aspiration. (

source: སངས་རྒྱས་བཅོམ་ལྡན་འདས་རྣམས་ནི་ལྟ་བའི་རྣམ་པ་ཐམས་ཅད་ཡོངས་སུ་བྱང་བ་སྟེ། ཞལ་དཔྲལ་བ་ལེགས་པར་གྲུབ་པ་དང་ལྡན་པ་ཡིན།
en: 71) The lord buddhas are endowed with a forehead that is well formed—indicating that they have refined all aspects of the view. (

source: སངས་རྒྱས་བཅོམ་ལྡན་འདས་རྣམས་ནི་ཕས་ཀྱི་རྒོལ་བ་ཤིན་དུ་འདུལ་བ་སྟེ།
en: 72) The lord buddhas are endowed with a forehead that is broad—indicating that they absolutely discipline those expounding opposing arguments. (

source: ཞལ་དཔྲལ་བ་ཡངས་པ་དང་ལྡན་པ་ཡིན། སངས་རྒྱས་བཅོམ་ལྡན་འདས་རྣམས་ནི་སྨོན་ལམ་དམ་པ་ཤིན་དུ་རྫོགས་པ་སྟེ། དབུ་ཤིན་དུ་རྒྱས་པ་ཡིན།
en: 73) The lord buddhas are endowed with a head that is very broad—indicating that they have absolutely perfected genuine aspirations. (

source: སངས་རྒྱས་བཅོམ་ལྡན་འདས་རྣམས་ནི་ཡུལ་གྱི་བུང་བ་རྣམ་པར་བཟློག་པ་སྟེ། དབུ་སྐྲ་བུང་བ་ལྟར་གནག་པ་དང་ལྡན་པ་ཡིན།
en: 74) The lord buddhas are endowed with hair as black as a bee—indicating that they have averted the bees of the sense objects. (

source: སངས་རྒྱས་བཅོམ་ལྡན་འདས་རྣམས་ནི་མཐོང་བ་དང་བསྒོམས་པས་སྤང་བའི་བག་ལ་ཉལ་བ་ཟད་པར་བྱས་པ་སྟེ་དབུ་སྐྲ་སྟུག་པ་ཡིན།
en: 75) The lord buddhas are endowed with thick hair—indicating that they have ended the latent impulses that are abandoned through [the paths of] insight and cultivation. (

source: སངས་རྒྱས་བཅོམ་ལྡན་འདས་རྣམས་ནི་ཐུགས་འཇམ་པས་བསྟན་པའི་སྙིང་པོ་ཐུགས་སུ་ཆུད་པ་སྟེ། དབུ་སྐྲ་འཇམ་པ་ཡིན།
en: 76) The lord buddhas are endowed with soft hair—indicating that their gentle mind comprehends the essence of the teaching. (

source: སངས་རྒྱས་བཅོམ་ལྡན་འདས་རྣམས་ནི་རྟག་ཏུ་མ་འཁྲུགས་པའི་ཐུགས་དང་ལྡན་པ་སྟེ། དབུ་སྐྲ་མ་འཛིངས་པ་ཡིན།
en: 77) The lord buddhas are endowed with untangled hair—indicating that they have a mind that is always undisturbed. (

source: སངས་རྒྱས་བཅོམ་ལྡན་འདས་རྣམས་ནི་བརླང་བའི་གསུང་དང་ཡོངས་སུ་བྲལ་བ་སྟེ། དབུ་སྐྲ་མི་རྩུབ་པ་ཡིན།
en: 78) The lord buddhas are endowed with smooth hair—indicating that they are utterly devoid of harsh speech. (

source: སངས་རྒྱས་བཅོམ་ལྡན་འདས་རྣམས་ནི་བྱང་ཆུབ་ཀྱི་ཡན་ལག་སྤོས་ཀྱི་མེ་ཏོག་གིས་སྐྱེ་བོ་འཐུན་པར་བསྒྲུབས་པ་སྟེ། དབུ་སྐྲ་དྲི་ཞིམ་པ་ཡིན།
en: 79) The lord buddhas are endowed with fragrant hair—indicating that they have established living creatures in harmony with the perfumed flowers of the branches of enlightenment. (

source: སངས་རྒྱས་བཅོམ་ལྡན་འདས་རྣམས་ནི་ཕྱག་དང་ཞབས་དཔལ་གྱི་བེའུ་དང་། བཀྲ་ཤིས་དང་དགའ་བ་འཁྱིལ་པས་བརྒྱན་པ་ཡིན།
en: 80) The lord buddhas have hands and feet adorned with the glorious śrīvatsa motif, the auspicious svāstika motif, and the nandyāvarta motif.

source: རབ་འབྱོར་དེ་དག་ནི་དེ་བཞིན་གཤེགས་པ་དགྲ་བཅོམ་པ་ཡང་དག་པར་རྫོགས་པའི་སངས་རྒྱས་ཀྱི་དཔེ་བྱད་བཟང་པོ་བརྒྱད་ཅུའོ།
en: Subhūti, these constitute the eighty minor marks of the tathāgatas, arhats, completely awakened buddhas. “

source: །རབ་འབྱོར་དེ་ལྟར་དེ་ལྟ་བུའི་ཆོས་ཀྱི་རྣམ་པ་དེ་དག་གཞན་ལ་བཤད་པ་དང་བསྟན་པ་དང་། ཡང་དག་པར་བསྟན་པ་དེ་ནི་འཇིག་རྟེན་ལས་འདས་པའི་ཆོས་ཀྱི་སྦྱིན་པ་ཞེས་བྱ་སྟེ།
en: So it is, Subhūti, that the explaining, teaching, and demonstrating of attributes such as these to others is called the gift of the supramundane doctrine.
